hugo/public/lunescript/lua/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>22.2. Lua と連携 編 - 公開技術情報</title>
<meta name="generator" content="Hugo 0.109.0">
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lunescript/lua/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="22.2. Lua と連携 編" />
<meta property="og:description" content="LuneScript は Lua のコードを実行できます。 しかし、Lua コードを実行するには幾つかの点で注意が必要です。 以降では、 LuneScript 上で Lua コードを実行する際の注意点を説" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lunescript/lua/" /><meta property="article:section" content="LuneScript" />

<meta property="og:site_name" content="公開技術情報" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="22.2. Lua と連携 編"/>
<meta name="twitter:description" content="LuneScript は Lua のコードを実行できます。 しかし、Lua コードを実行するには幾つかの点で注意が必要です。 以降では、 LuneScript 上で Lua コードを実行する際の注意点を説"/>
<meta itemprop="name" content="22.2. Lua と連携 編">
<meta itemprop="description" content="LuneScript は Lua のコードを実行できます。 しかし、Lua コードを実行するには幾つかの点で注意が必要です。 以降では、 LuneScript 上で Lua コードを実行する際の注意点を説">

<meta itemprop="wordCount" content="2212">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/lnsc_web_frontend/for_fengari/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>22.2. Lua と連携 編</h1>

<p>
LuneScript は Lua のコードを実行できます。</p>
<p>
しかし、Lua コードを実行するには幾つかの点で注意が必要です。</p>
<p>
以降では、 LuneScript 上で Lua コードを実行する際の注意点を説明します。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Lua コードの実行
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
LuneScript では、
<code class="verbatim">_load()</code> 関数などを利用することで LuneScript 内から Lua のコードを実行できます。</p>
<p>
<code class="verbatim">_load()</code> 関数は、 lua の <code class="verbatim">load()</code> 関数と基本的に同じ仕様です。</p>
<p>
以下にサンプルを示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
let code = ```
return { val1 = 10, val2 = 20 }
```;
let loaded, err = _load( code, nil );
when! loaded {
   if! let obj = loaded( ## ) {
      forsort val, key in obj@@Map&lt;str,int&gt; {
         print( key, val + 100 ); 
      }
   }
} else {
   print( err );
}</code></pre>
</div>
<p>
このサンプルは、次の値を出力します。</p>
<div class="src src-txt">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-txt" data-lang="txt"><span class="line"><span class="cl">val1	110
</span></span><span class="line"><span class="cl">val2	120</span></span></code></pre></div>
</div>
<p>
これは、Lua のコード <code>return { val1 = 10, val2 = 20 }</code> が返す Lua のテーブルを、
forsort で列挙して <code class="verbatim">print( key, val + 100 );</code> で出力した結果です。</p>
<p>
上記サンプルは、以下の LuneScript のコードとほぼ同じと言えます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn func():Map&lt;str,int&gt; {
   return { &#34;val1&#34;:10, &#34;val2&#34;:20 };
}
forsort val, key in func() {
   print( key, val + 100 ); 
}</code></pre>
</div>
<p>
このように、 LuneScript と Lua は連携して動作することが出来ます。</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Lua → LuneScript のデータ変換
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
LuneScript から Lua のコードを実行したとき、
その Lua コードの実行結果は Luaval 型になります。</p>
<p>
Luaval 型は、Lua コード内のデータを保持する型で、
LuneScript の型 T に相当する Lua コード内のデータは <code class="verbatim">Luaval&lt;T&gt;</code> となります。</p>
<p>
例えば上記サンプルの <code>{ val1 = 10, val2 = 20 }</code> は、
LuneScritp の Map&lt;str,int&gt; に相当し、 <code class="verbatim">Luaval&lt;Map&lt;str,int&gt;&gt;</code> となります。</p>
<p>
なお、 LuneScript から Lua にトランスコンパイルする場合、
<strong>Luaval&lt;T&gt; は T と完全に一致した型</strong> になります。
LuneScript から Lua にトランスコンパイルする場合、
例え Luaval&lt;T&gt; と明示的に宣言しても内部的に T として変換されるため、
Luaval&lt;T&gt; を意識する必要はありません。</p>
<p>
LuneScript から Lua 以外の言語(現在は go に変換可能)に変換する場合、
Luaval&lt;T&gt; と T は明確に扱いが異なるため、
Lua 以外に変換する場合は Luaval&lt;T&gt; を意識する必要があります。</p>
<p>
<strong>トランスコンパイルのオプションに &#34;–valid-luaval&#34; を指定</strong> することで、
Lua にトランスコンパイルする際も、Luaval&lt;T&gt; と T を分けて管理します。</p>
<p>
上記サンプルは、次のように <code class="verbatim">Luaval&lt;Map&lt;str,int&gt;&gt;</code> の引数を持つ
<code class="verbatim">func()</code> を使用するように書き換えることが出来ます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn func(map:Luaval&lt;&amp;Map&lt;str,int&gt;&gt;) {
   forsort val, key in map {
      print( key, val + 100 ); 
   }
}
let code = ```
return { val1 = 10, val2 = 20 }
```;
let loaded, err = _load( code, nil );
when! loaded {
   if! let obj = loaded( ## ) {
      func( obj@@Map&lt;str,int&gt; );
   }
} else {
   print( err );
}</code></pre>
</div>
<p>
また上記のサンプルの様に Map の Luaval 型のデータに対しても、
LuneScript の Map と同様に
foreach や <code class="verbatim">[]</code> を使用した要素アクセスなどで、Map 内のデータを参照できます。
ただし参照は出来ますが、 <strong>変更は出来ません。</strong></p>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
相互変換可能な型
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
Lua コード内のデータの型が次の場合、
Luaval 型とはならずにそのままの型になります。</p>
<ul>
<li>int, real, bool, str</li>
<li>上記の nilable</li>
</ul>
<p>str に関しては、 <strong>文字列長に比例したオーバーヘッド</strong> が掛かります。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Luaval 型のキャスト
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
Luaval 型のキャストには制限があります。</p>
<p>
上記サンプルは、次のように func の引数に  <code class="verbatim">obj@@Map&lt;str,int&gt;</code> を渡しています。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: skip   
   if! let obj = loaded( ## ) {
      func( obj@@Map&lt;str,int&gt; );
   }</code></pre>
</div>
<p>
これは obj を Map&lt;str,int&gt; 型にキャストする演算ですが、
ここで obj の型は Luaval&lt;stem&gt; 型であり、
それを Map&lt;str,int&gt; にキャストすると、
そのキャスト後の型は Luaval&lt;Map&lt;str,int&gt;&gt; になります。</p>
<p>
ある型 T1 から T2 型にキャストが可能だった時、
Luaval&lt;T1&gt; から T2 へのキャストを指示した場合、
そのキャスト結果は Luaval&lt;T2&gt; になります。</p>
<p>
また、次のキャストは出来ません。</p>
<ul>
<li>T1 型から Luaval&lt;T1&gt; 型へのキャスト</li>
<li>Luaval&lt;T1&gt; 型から T1 型へのキャスト</li>
</ul>
<p>具体的には Map&lt;str,int&gt; から Luaval&lt;Map&lt;str,int&gt;&gt; へのキャストは出来ません。</p>
<p>
ただし、 stem 型は例外的に Luaval との相互キャストが可能です。</p>
<p>
なお、次のように stem 型を経由することで、
Luaval 型から非 Luaval 型へのキャストが可能ですが、</p>
<pre class="example">
Luaval =&gt; stem =&gt; Luaval
</pre>
<p>
本来とは異なる型にキャストした時の動作は <strong>未定義</strong> です。</p>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
expandLuavalMap
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
Lua コード内の collection のデータは、 Luaval として扱います。</p>
<p>
たとえば、 Map 型のデータは Luaval&lt;Map&gt; です。
Map 型と Luaval&lt;Map&gt; 型のデータは互換性がないため、代入などは出来ません。</p>
<p>
この collection の Luaval 型のデータを LuneScript の値として展開する方法として、
次の関数を提供しています。</p>
<pre class="example">
fn expandLuavalMap( Luaval&lt;stem&gt;! ) : stem!;
</pre>
<p>
この関数を使用すると、次のような処理が掛けます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
fn func(map:Luaval&lt;&amp;Map&lt;str,int&gt;&gt;) {
   forsort val, key in map {
      print( key, val + 100 ); 
   }
}
fn func2(map:&amp;Map&lt;str,int&gt;) {
   forsort val, key in map {
      print( key, val + 100 ); 
   }
}
let code = ```
return { val1 = 10, val2 = 20 }
```;
let loaded, err = _load( code, nil );
when! loaded {
   if! let obj = loaded( ## ) {
      func( obj@@Map&lt;str,int&gt; );
      if! let map = expandLuavalMap( obj ) {
         func2( map@@Map&lt;str,int&gt; );
      }
   }
} else {
   print( err );
}</code></pre>
</div>
<p>
このサンプルでは、 Luaval&lt;&amp;Map&lt;str,int&gt;&gt; を列挙する <code class="verbatim">func()</code> 関数と、
&amp;Map&lt;str,int&gt; を列挙する <code class="verbatim">func2()</code> 関数があります。</p>
<p>
func2() をコールする前に <code class="verbatim">expandLuavalMap()</code> で Luaval 型のデータを展開し、
それを Map&lt;str,int&gt; にキャストするこおで Luaval&lt;Map&lt;str,int&gt;&gt; ではなく、
Map&lt;str,int&gt; として処理しています。</p>
<p>
なお <code class="verbatim">expandLuavalMap()</code> は、
引数で与えられた Luaval 型のデータを展開したクローンを作成します。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Luaval 型の型変換
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>
ある nilable 型の T! を保持する Luaval 型は、 Luaval&lt;T&gt;! になります。
Luaval&lt;T!&gt; にはなりません。</p>
<p>
また、 Luaval&lt;T&gt; の Immutable は Luaval&lt;&amp;T&gt; になります。</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Luaval 型の関数、Luaval 型オブジェクトのメソッド
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>
関数型の Luaval は、その引数、戻り値も Luaval 型になります。</p>
<p>
例えば次のサンプルの func 関数の引数 proc は、
Luaval&lt;Process&gt; 型の From であり、
この Form の引数は Luaval&lt;&amp;List&lt;int&gt;&gt; 、
戻り値は Luaval&lt;&amp;List&lt;int&gt;&gt; になります。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: skip
   form Process( val:&amp;List&lt;int&gt; ) : &amp;Map&lt;int&gt;;
   fn func( proc:Luaval&lt;Process&gt; ) {
      let list = proc( [ 1, 2, 3 ] );
   }</code></pre>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
LuneScript → Lua のデータ変換
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>
Lua の関数に LuneScript の値を渡す時は、Luaval 型の値を渡す必要があります。</p>
<p>
ただし、 Lua の関数の引数が次の値の場合、
Luava 型ではなくそのままの型になります。</p>
<ul>
<li>int, real, bool, str</li>
<li>上記を要素に持つ List などのコレクション型  </li>
<li>上記の nilable</li>
</ul>
<p>次にサンプルを示します。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
let code = ```
return function( tbl )
   local total = 0
   for key, val in pairs( tbl ) do
      total = total + val
   end
   return total
end
```;
let loaded, err = _load( code, nil );
when! loaded {
   if! let obj = loaded( ## ) {
   let map = { &#34;val1&#34;:1, &#34;val2&#34;:10 };
      print( (obj@@form)( map ) );  // Lua の関数コール
   }
} else {
   print( err );
}</code></pre>
</div>
<p>
このサンプルは、
引数で与えられた Lua のテーブルの要素の値の合計を計算する関数をコールします。</p>
<p>
このサンプルでは、
Map&lt;str,int&gt; 型のデータ map を Lua の関数の引数に指定して実行しています。</p>
<p>
このとき、内部的に Map&lt;str,int&gt; 型のデータが Lua のテーブルに変換されています。</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/lunescript/glue/" title="22.1. glue コードの半自動生成"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - 22.1. glue コードの半自動生成</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/lunescript/make/" title="23. ビルド 編">Next - 23. ビルド 編 <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/javascript/thread/">JavaScript のスレッド(非同期処理)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tuple/">04.3 タプル編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/error/">10.6. エラーハンドリング編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics-go/">19.2. generics (2つの collection 型) 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/ebnf/">A. BNF</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design/">Y.1 LuneScript の開発方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-2/">Y.2 LuneScript の開発(型情報管理)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/design-3/">Y.3 LuneScript の開発(スコープとシンボル)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
